models/Tasks.php

    public static function getAllTasks(){
        $tasks = Tasks::find()->asArray()->all();
---
SELECT * FROM `tasks`

    public static function addTask($what){
        $task = new Tasks;
        $task->what = $what;
        $task->finish = "no";
        if($task->save()){
---
INSERT INTO `tasks` (`what`, `finish`) VALUES ('21312312312', 'no')

    public static function deleteTask($id){
        $task = Tasks::find()->where(['id'=>$id])->one();
        if($task->delete()){
---
SELECT * FROM `tasks` WHERE `id`='45'
DELETE FROM `tasks` WHERE `id`='45'

    public static function changeTask($id,$finish){
        $task = Tasks::find()->where(['id'=>$id])->one();
        if($finish == 'yes'){
            $task->finish = 'no';
        }else{
            $task->finish = 'yes';
        }
        if($task->save()){
---
SELECT * FROM `tasks` WHERE `id`='38'
UPDATE `tasks` SET `finish`='no' WHERE `id`='38'